Tekla Open API Reference for Tekla Structures 2025
HierarchicDefinition Constructor
Overload List
Name | Description
HierarchicDefinition()
 Creates a new hierarchical definition instance.
HierarchicDefinition(Identifier)
 Instantiates a hierarchical definition with a known identifier. The instantiation has to be done before the hierarchical definition instance can be selected.
Top
See Also
Reference
HierarchicDefinition Class
Tekla.Structures.Model Namespace